**Вопрос 1**

Хорошая визуализация — дело субъективное, и в случае дашбордов это справедливо втройне. Однако некоторые дашборды определённо лучше других, и здесь мы с вами попробуем выделить некоторые правила хорошего тона при их создании!

Начнём с общих правил. Что из этого точно будет хорошей идеей? 

- Использовать больше разнообразной визуализации
- **Настроить структуру дашборда логичным образом**
- Употреблять "технические" названия из изначальных данных
- **Выдерживать подписи в дашборде на одном языке**
- **Ориентироваться на требования заказчика**

**Вопрос 2**

Ещё немного углубимся в структуру дашборда. Какие из этих рекомендаций однозначно можно назвать хорошими?

- Оперативный дашборд важно сделать таким, чтобы было удобно находить тенденции, анализировать данные и принимать стратегические решения
- Дашборд стоит делать подробным, чтобы все пользователи могли найти нужную для себя информацию — его размер может быть 2-3 листа
- Стоит оставлять как можно больше пустого пространства на дашборде, чтобы все графики и таблицы явно выделялись
- **Дашборд стоит дополнить навигацией по нему, чтобы у пользователей не было вопросов по графикам, срезам и сценарию использования**
- **Дашборд стоит строить от более важного до менее важного — вверху мы ставим самые важные графики, а дальше уточняющие**


**Вопрос 3**

Два вечных вопроса: "Быть или не быть?" и "Какие виды визуализации использовать?". 

Сопоставьте цель и подходящий для неё тип графика.


**Показать динамику метрики во времени -> Линейные графики (line plot)**

**Отразить часть от целого -> Круговая диаграмма (pie chart/donut chart)**

**Показать трёхмерные зависимости между переменными -> Тепловая карта (heatmap)**

**Показать частоту определённых категорий -> Столбиковые диаграммы (bar plot)**


**Вопрос 4**

Когда речь заходит о цветах, распространена поговорка "make it right in black and white" (буквально "сделай правильно в чёрно-белом"). Также можно встретить рекомендацию использовать в качестве базового цвета голубой и его оттенки, а для контраста использовать красные и оранжевые цвета.

Выберите вариант ответа, адекватно объясняющий оба утверждения.

- Эти цвета могут быть корпоративными, а использовать корпоративную палитру — хорошая идея
- Так мы гарантируем, что цвета будут контрастными и легко различимыми
- Такие цвета выглядят особенно стильно
- **Визуализации должны хорошо читаться пользователями с цветовой слепотой**


# Задание 1
Мы выяснили, что главный вопрос, на который должна отвечать аналитика на самом начальном этапе — это вопрос «сколько?».

На практике это означает, что если нам поручили настроить аналитику продукта, нужно начать с нескольких базовых дашбордов, которые покрывают собой ключевые аудиторные метрики и ключевые события нашего продукта. В лекции мы заложили основу двух дашбордов по ленте новостей, ваша задача теперь доделать эти дашборды. Подумайте, какие еще графики, срезы, метрики имеет смысл добавить на дашборды. С чего начать? Может, например, стоит как-то отобразить число событий на одного юзера?

В качестве решения этого задания вам нужно сделать:

Основной дашборд за всё прошлое время.

<div style="display: flex; justify-content: center;">
  <img src="https://sun9-62.userapi.com/impg/gDYDn0c9b8YHcV05gJt44xiDQKdxV1tzIui5Ew/Fo-xn0SoSzk.jpg?size=532x1080&quality=95&sign=cbdd49d5db3b0e8f2ba625102decffef&type=album" alt="Основной дашборд за всё прошлое время">
</div>


Оперативный дашборд с графиками за сегодняшний день.
![Описание изображения](https://sun9-14.userapi.com/impg/Zrfx32iKuGEjpWOFrz3MIStHvINUrPo0jFGkkg/tkYONNHC1Q8.jpg?size=1280x819&quality=95&sign=648218d2070fe43e409477ac043dac7d&type=album)



**Вопрос 5**




